[
  {
    "title": "Winter Day Dreams ft. Franny's Feet and Olivia",
    "year": 2010,
    "cast": [
      "Franny's Feet",
      "Phoebe McAuley",
      "George Buza",
      "Katherine Crimi",
      "Emily Gray"
    ],
    "genres": [
      "Animated",
      "Family"
    ],
    "href": "Franny%27s_Feet",
    "extract": "Franny's Feet is a Canadian animated children's television series created by writer Cathy Moss and fellow Susin Nielsen. The series was produced by Decode Entertainment, in association with Channel Five Broadcasting Limited. The series follows the adventures of Frances \"Franny\" Fantootsie as she tries on a new shoe and travels to different countries.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/commons/2/23/Frannys_Feet_Logo.png",
    "thumbnail_width": 200,
    "thumbnail_height": 108
  },
  {
    "title": "Garbage Dreams",
    "year": 2010,
    "cast": [],
    "genres": [
      "Documentary"
    ],
    "href": "Garbage_Dreams",
    "extract": "Garbage Dreams is a 2009 feature length documentary film produced and directed by Mai Iskander. Filmed over the course of four years, Garbage Dreams follows three teenage boys growing up in Egypt's garbage village. Garbage Dreams aired on the PBS program Independent Lens for the occasion of Earth Day 2010 and has been screened in many international film festivals."
  },
  {
    "title": "Sweetgrass",
    "year": 2010,
    "cast": [],
    "genres": [
      "Documentary"
    ],
    "href": "Sweetgrass_(film)",
    "extract": "Sweetgrass is a 2009 documentary film that follows modern-day shepherds as they lead their flocks of sheep up into Montana's Absaroka-Beartooth mountains for summer pasture. It was directed by Lucien Castaing-Taylor, a Harvard anthropologist, and produced by his wife Ilisa Barbash. The title derives from Sweet Grass County, one of several in which the film was shot.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/62/SweetgrassPoster.jpg",
    "thumbnail_width": 260,
    "thumbnail_height": 384
  },
  {
    "title": "Daybreakers",
    "year": 2010,
    "cast": [
      "Ethan Hawke",
      "Willem Dafoe",
      "Sam Neill",
      "Claudia Karvan",
      "Michael Dorman",
      "Isabel Lucas",
      "Vince Colosimo",
      "Jay Laga'aia"
    ],
    "genres": [
      "Action",
      "Horror",
      "Science Fiction"
    ],
    "href": "Daybreakers",
    "extract": "Daybreakers is a 2009 science-fiction action horror film written and directed by Michael and Peter Spierig. The film takes place in a futuristic world overrun by vampires, and centers around a vampiric corporation which sets out to capture and farm the remaining humans while researching a substitute for human blood. Ethan Hawke plays vampire hematologist Edward Dalton, whose work is interrupted by human survivors led by former vampire \"Elvis\", who has a cure that can save the human species.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b4/Daybreakers_ver2.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "Leap Year",
    "year": 2010,
    "cast": [
      "Amy Adams",
      "Matthew Goode",
      "Adam Scott",
      "John Lithgow",
      "Kaitlin Olson",
      "Noel O'Donovan",
      "Tony Rohr",
      "Pat Laffan",
      "Alan Devlin",
      "Ian McElhinney",
      "Vincenzo Nicoli",
      "Flaminia Cinque",
      "Peter O'Meara"
    ],
    "genres": [
      "Comedy",
      "Romance"
    ],
    "href": "Leap_Year_(2010_film)",
    "extract": "Leap Year is a 2010 romantic comedy directed by Anand Tucker and written by Harry Elfont and Deborah Kaplan. Leap Year stars Amy Adams and Matthew Goode.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/da/Leap_year_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "Youth in Revolt",
    "year": 2010,
    "cast": [
      "Michael Cera",
      "Portia Doubleday",
      "Justin Long",
      "Steve Buscemi",
      "Ray Liotta",
      "Jean Smart",
      "Zach Galifianakis",
      "Erik Knudsen",
      "Adhir Kalyan",
      "Fred Willard",
      "Ari Graynor",
      "Rooney Mara",
      "Jade Fusco",
      "M. Emmet Walsh",
      "Mary Kay Place",
      "Jonathan Bradford Wright",
      "Michael Collins"
    ],
    "genres": [
      "Comedy",
      "Drama",
      "Romance"
    ],
    "href": "Youth_in_Revolt_(film)",
    "extract": "Youth in Revolt is a 2009 American romantic comedy-drama film directed by Miguel Arteta and written by Gustin Nash. Based on C.D. Payne's epistolary novel of the same name, the film stars Michael Cera and Portia Doubleday, with Justin Long, Ray Liotta, and Steve Buscemi in supporting roles.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/94/Youth_in_Revolt_Poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "B*tch Slap",
    "year": 2010,
    "cast": [
      "Julia Voth",
      "Erin Cummings",
      "America Olivo",
      "Ron Melendez",
      "William Gregory Lee",
      "Minae Noji",
      "Michael Hurst"
    ],
    "genres": [
      "Action"
    ],
    "href": "Bitch_Slap",
    "extract": "Bitch Slap is a 2009 American action film directed by Rick Jacobson and starring Julia Voth, Erin Cummings, America Olivo and Michael Hurst, with cameos by Lucy Lawless, Kevin Sorbo, and Renee O'Connor.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/03/Bitch_slap_poster.jpg",
    "thumbnail_width": 260,
    "thumbnail_height": 383
  },
  {
    "title": "Crazy on the Outside",
    "year": 2010,
    "cast": [
      "Tim Allen",
      "Sigourney Weaver",
      "Ray Liotta",
      "J.K. Simmons",
      "Julie Bowen",
      "Kelsey Grammer",
      "Jeanne Tripplehorn",
      "Kenton Duty",
      "Daniel Booko",
      "Karle Warren",
      "Robert Baker",
      "Casey Sander",
      "Jon Gries",
      "Malcolm Goodwin",
      "Rocky LaPorte",
      "Meeghan Holaway"
    ],
    "genres": [
      "Comedy"
    ],
    "href": "Crazy_on_the_Outside",
    "extract": "Crazy on the Outside is a 2010 American comedy film starring and directed by Tim Allen. The film marks Allen's feature film directorial debut, and is notable for reuniting Allen with co-stars from many of his previous films.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/56/Crazy_on_the_outside_poster.jpg",
    "thumbnail_width": 263,
    "thumbnail_height": 379
  },
  {
    "title": "Waiting for Armageddon",
    "year": 2010,
    "cast": [],
    "genres": [
      "Documentary"
    ],
    "href": "Waiting_for_Armageddon",
    "extract": "Waiting for Armageddon is a 2009 American documentary film that studies Armageddon theology and Christian eschatology. Some evangelicals in the United States believe that bible prophecy predicts events including the rapture and the Battle of Armageddon. The documentary raises questions regarding how this theology shapes United States and Middle East relations and how it may encourage an international holy war.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/77/Waitingforarmageddom.jpg",
    "thumbnail_width": 200,
    "thumbnail_height": 284
  },
  {
    "title": "Wonderful World",
    "year": 2010,
    "cast": [
      "Matthew Broderick",
      "Sanaa Lathan",
      "Michael K. Williams",
      "Jodelle Ferland",
      "Jesse Tyler Ferguson",
      "Ally Walker",
      "Philip Baker Hall"
    ],
    "genres": [
      "Comedy",
      "Drama"
    ],
    "href": "Wonderful_World_(2009_film)",
    "extract": "Wonderful World is a 2009 dark comedy-drama film written and directed by Joshua Goldin, and starring Matthew Broderick, Sanaa Lathan, Michael K. Williams, Jodelle Ferland, Jesse Tyler Ferguson, Ally Walker, and Philip Baker Hall. It is Goldin's directorial debut. The story revolves around a misanthropic, former children's folk singer having his life changed after his Senegalese roommate goes into a diabetic coma, and the sister who arrives to take care of him that he falls in love with.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f7/Wonderful_world_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "The Book of Eli",
    "year": 2010,
    "cast": [
      "Denzel Washington",
      "Gary Oldman",
      "Mila Kunis",
      "Ray Stevenson",
      "Jennifer Beals",
      "Evan Jones",
      "Joe Pingue",
      "Frances de la Tour",
      "Michael Gambon",
      "Tom Waits",
      "Chris Browning",
      "Malcolm McDowell"
    ],
    "genres": [
      "Action",
      "Western"
    ],
    "href": "The_Book_of_Eli",
    "extract": "The Book of Eli is a 2010 American post-apocalyptic neo-Western action film directed by the Hughes Brothers, written by Gary Whitta, and starring Denzel Washington, Gary Oldman, Mila Kunis, Ray Stevenson, and Jennifer Beals. The story revolves around Eli, a nomad in a post-apocalyptic world who seeks to deliver his copy of a mysterious book to a safe location on the West Coast of the United States. Filming began in February 2009 and took place in New Mexico.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/e3/Book_of_eli_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "The Spy Next Door",
    "year": 2010,
    "cast": [
      "Jackie Chan",
      "Amber Valletta",
      "Magnús Scheving",
      "Billy Ray Cyrus",
      "George Lopez",
      "Lucas Till",
      "Katherine Boecher",
      "Madeline Carroll",
      "Alina Foley",
      "Will Shadley",
      "Jeff Chase",
      "Esodie Geiger"
    ],
    "genres": [
      "Action",
      "Comedy",
      "Spy"
    ],
    "href": "The_Spy_Next_Door",
    "extract": "The Spy Next Door is a 2010 American spy action comedy film directed by Brian Levant, written by Jonathan Bernstein, James Greer and Gregory Poirier, produced by Robert Simonds with music by David Newman. The film stars Jackie Chan, with a supporting cast of Amber Valletta, Magnús Scheving, Madeline Carroll, Will Shadley, Alina Foley, Billy Ray Cyrus and George Lopez. Filming started in late October 2008 in Rio Rancho, New Mexico and was finished in late December 2008. The film was released on January 15, 2010 in the United States by Lionsgate. The film was released on DVD, and Blu-ray on May 18, 2010. The film tributes Chan's films by showing clips, references and even referencing Chan's real life childhood. The film received negative reviews from critics and it earned $45.2 million on a $28 million budget.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/6d/Spy_next_door_ver2.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "44 Inch Chest",
    "year": 2010,
    "cast": [
      "Ray Winstone",
      "Ian McShane",
      "John Hurt",
      "Tom Wilkinson",
      "Stephen Dillane",
      "Joanne Whalley",
      "Melvil Poupaud",
      "Steven Berkoff",
      "Edna Doré",
      "Andy de la Tour",
      "Derek Lea"
    ],
    "genres": [
      "Comedy",
      "Crime",
      "Drama"
    ],
    "href": "44_Inch_Chest",
    "extract": "44 Inch Chest is a 2009 British crime comedy-drama film directed by Malcolm Venville in his directorial debut. The film stars Ray Winstone, Ian McShane, John Hurt, Tom Wilkinson, Stephen Dillane and Joanne Whalley. The film was released on 19 October 2009.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/a/aa/44_inch_chest_poster.jpg/320px-44_inch_chest_poster.jpg",
    "thumbnail_width": 320,
    "thumbnail_height": 240
  },
  {
    "title": "Fish Tank",
    "year": 2010,
    "cast": [
      "Katie Jarvis",
      "Michael Fassbender",
      "Kierston Wareing",
      "Harry Treadaway",
      "Jason Maza",
      "Rebecca Griffiths"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Fish_Tank_(film)",
    "extract": "Fish Tank is a 2009 British drama film written and directed by Andrea Arnold. The film is about Mia, a volatile and socially isolated 15-year-old, and her relationship with her mother's new boyfriend. Fish Tank was well-received and won the Jury Prize at the 2009 Cannes Film Festival. It also won the 2010 BAFTA for Best British Film. It was included in the BBC's The 21st Century's 100 greatest films, ranking at no. 65 on the list.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d7/Fish_tank_poster.jpg/320px-Fish_tank_poster.jpg",
    "thumbnail_width": 320,
    "thumbnail_height": 239
  },
  {
    "title": "House of Numbers: Anatomy of an Epidemic",
    "year": 2010,
    "cast": [],
    "genres": [],
    "href": "House_of_Numbers:_Anatomy_of_an_Epidemic",
    "extract": "House of Numbers: Anatomy of an Epidemic is a 2009 film directed, produced, and hosted by Brent Leung and described by him as an objective examination of the idea that HIV causes AIDS. The film argues that human immunodeficiency virus (HIV) is harmless and does not cause acquired immune deficiency syndrome (AIDS), a position known as AIDS denialism. The film's claims of impartiality have been widely rejected by scientists, and the film's claims about HIV and AIDS have been dismissed as pseudoscience and conspiracy theory masquerading as even-handed examination.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/76/House_of_Numbers_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "Extraordinary Measures",
    "year": 2010,
    "cast": [
      "Brendan Fraser",
      "Harrison Ford",
      "Keri Russell",
      "Courtney B. Vance",
      "Meredith Droeger",
      "Diego Velazquez",
      "Sam M. Hall",
      "Patrick Bauchau",
      "Jared Harris",
      "Alan Ruck",
      "David Clennon",
      "Dee Wallace",
      "Ayanna Berkshire",
      "P.J. Byrne",
      "Andrea White",
      "G.J. Echternkamp",
      "Vu Pham",
      "Derek Webster",
      "John Crowley"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Extraordinary_Measures",
    "extract": "Extraordinary Measures is a 2010 American medical drama film starring Brendan Fraser, Harrison Ford, and Keri Russell. It was the first film produced by CBS Films, the film division of CBS Corporation, who released the film on January 22, 2010. The film is about parents who form a biotechnology company to develop a drug to save the lives of their children, who have a life-threatening disease. The film is based on the true story of John and Aileen Crowley, whose children have Pompe's disease. The film was shot in St. Paul, Oregon; Portland, Oregon; Tualatin, Oregon; Wilsonville, Oregon; Manzanita, Oregon; Beaverton, Oregon, and Vancouver, Washington.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/59/Extraordinary_measures_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "Legion",
    "year": 2010,
    "cast": [
      "Paul Bettany",
      "Lucas Black",
      "Tyrese Gibson",
      "Adrianne Palicki",
      "Charles S. Dutton",
      "Jon Tenney",
      "Kevin Durand",
      "Willa Holland",
      "Kate Walsh",
      "Dennis Quaid",
      "Jeanette Miller",
      "Doug Jones",
      "Josh Stamberg",
      "Yancey Arias"
    ],
    "genres": [
      "Action",
      "Horror"
    ],
    "href": "Legion_(2010_film)",
    "extract": "Legion is a 2010 American action horror film directed by Scott Stewart and co-written by Stewart and Peter Schink. The film stars Paul Bettany, Lucas Black, Tyrese Gibson, Adrianne Palicki, Kate Walsh, and Dennis Quaid. Sony Pictures Worldwide Acquisitions Group acquired most of the film's worldwide distribution rights, and the group opened the film in North America theatrically on January 22, 2010, through Screen Gems.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f3/Legion_poster.jpg",
    "thumbnail_width": 192,
    "thumbnail_height": 286
  },
  {
    "title": "102 Dalmatians",
    "year": 2000,
    "cast": [
      "Glenn Close",
      "Gérard Depardieu",
      "Alice Evans"
    ],
    "genres": [
      "Comedy",
      "Family",
      "Crime"
    ],
    "href": "102_Dalmatians",
    "extract": "102 Dalmatians is a 2000 American crime comedy film directed by Kevin Lima and produced by Edward S. Feldman and Walt Disney Pictures. The sequel to the 1996 film 101 Dalmatians, a live-action remake of the 1961 Disney animated film of the same name, it stars Glenn Close reprising her role as Cruella de Vil as she attempts to steal puppies for her \"grandest\" fur coat yet. Glenn Close and Tim McInnerny were the only two actors from the 1996 film to return for the sequel. The film received generally negative reviews from critics and was unable to achieve the box office success of its predecessor, although the film was nominated for the Academy Award for Best Costume Design.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fe/102_dalmatians_poster.jpg",
    "thumbnail_width": 220,
    "thumbnail_height": 327
  },
  {
    "title": "28 Days",
    "year": 2000,
    "cast": [
      "Sandra Bullock",
      "Viggo Mortensen"
    ],
    "genres": [
      "Drama",
      "Comedy"
    ],
    "href": "28_Days_(film)",
    "extract": "28 Days is a 2000 American comedy-drama film directed by Betty Thomas and written by Susannah Grant. Sandra Bullock stars as Gwen Cummings, a newspaper columnist obliged to enter rehabilitation for alcoholism. The film costars Viggo Mortensen, Dominic West, Elizabeth Perkins, Azura Skye, Steve Buscemi, and Diane Ladd.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f7/28_Days_Poster.jpg",
    "thumbnail_width": 238,
    "thumbnail_height": 360
  },
  {
    "title": "3 Strikes",
    "year": 2000,
    "cast": [
      "Brian Hooks",
      "N'Bushe Wright"
    ],
    "genres": [
      "Comedy"
    ],
    "href": "3_Strikes_(film)",
    "extract": "3 Strikes is a 2000 American comedy film written and directed by DJ Pooh, and starring Brian Hooks, N'Bushe Wright, Faizon Love and David Alan Grier. Despite some commercial success, it was negatively received by critics. The title refers to California's habitual offender law, whereby three convictions confer an automatic life sentence.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/db/3_Strikes_Poster.jpg",
    "thumbnail_width": 225,
    "thumbnail_height": 333
  },
  {
    "title": "The 6th Day",
    "year": 2000,
    "cast": [
      "Arnold Schwarzenegger",
      "Robert Duvall",
      "Michael Rooker",
      "Tony Goldwyn",
      "Michael Rapaport",
      "Sarah Wynter",
      "Rodney Rowland",
      "Wendy Crewson",
      "Terry Crews"
    ],
    "genres": [
      "Science Fiction",
      "Action"
    ],
    "href": "The_6th_Day",
    "extract": "The 6th Day is a 2000 American science fiction action film directed by Roger Spottiswoode and starring Arnold Schwarzenegger, Tony Goldwyn, Michael Rapaport, and Robert Duvall. In the film, a family man of the future is illegally cloned by accident as part of a vast conspiracy involving a shady billionaire businessman, and is thrust into a struggle to clear his name and protect his family from the conspirators who seek to keep the cloning a secret. The title refers to the Judeo-Christian Genesis creation narrative, where God created mankind on the sixth day. The film was Terry Crews' acting debut.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a0/The_6th_Day_%282000_film%29.jpg",
    "thumbnail_width": 257,
    "thumbnail_height": 387
  },
  {
    "title": "Across the Line",
    "year": 2000,
    "cast": [
      "Brad Johnson",
      "Adrienne Barbeau",
      "Brian Bloom"
    ],
    "genres": [
      "Thriller",
      "Western"
    ],
    "href": "Across_the_Line_(2000_film)",
    "extract": "Across the Line is a 2000 American Neo-Western film directed by Martin Spottl and starring Brad Johnson and Sigal Erez. Johnson plays a small-town Texas sheriff who falls for an illegal immigrant (Erez) who witnessed a murder on the Mexican border. While not an overtly political film, Across the Line portrays illegal immigrants in a generally positive light and dramatizes their motivations and problems from a sympathetic point of view. In La Opinion Jean Rodriguez Flores wrote, \"The film Across the Line isn't just about the difficulties of crossing illegally into the United States, but it also reflects the tragedy of hundreds of people who are forced to leave their families for the \"promised land.\" Some critics praised the film for its emotional intensity, authenticity, and integrity, but others questioned it for turning the plight of illegal immigrants into mainstream entertainment. Independently financed and produced, Across the Line was distributed by Lionsgate Entertainment.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/49/Across_the_Line.jpg",
    "thumbnail_width": 246,
    "thumbnail_height": 345
  },
  {
    "title": "Adventures in Wild California",
    "year": 2000,
    "cast": [
      "Jimmy Smits",
      "(Narrator)"
    ],
    "genres": [
      "Documentary"
    ],
    "href": "Adventures_in_Wild_California",
    "extract": "Adventures in Wild California is a documentary film showcasing the scenery and extreme sports found in California. It is narrated by Jimmy Smits and was released to IMAX theaters in 2000. The film is directed by Greg MacGillivray and features songs by musician Lindsey Buckingham.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/e9/Adventuresinwildcalifornia.jpg",
    "thumbnail_width": 234,
    "thumbnail_height": 425
  },
  {
    "title": "The Adventures of Rocky and Bullwinkle",
    "year": 2000,
    "cast": [
      "Rene Russo",
      "Jason Alexander",
      "Robert De Niro",
      "Piper Perabo",
      "June Foray",
      "Keith Scott"
    ],
    "genres": [
      "Comedy",
      "Live Action",
      "Adventure",
      "Animated"
    ],
    "href": "The_Adventures_of_Rocky_and_Bullwinkle_(film)",
    "extract": "The Adventures of Rocky and Bullwinkle is a 2000 American live-action/animated adventure slapstick comedy film directed by Des McAnuff and produced by Universal Pictures, based on the television cartoon of the same name by Jay Ward. Animated characters Rocky and Bullwinkle share the screen with live actors portraying Fearless Leader, Boris Badenov and Natasha Fatale along with Randy Quaid, Piper Perabo, Kenan Thompson and Kel Mitchell. June Foray reprised her role as Rocky, while Keith Scott voiced Bullwinkle and the film's narrator. It also features cameo appearances by performers including James Rebhorn, Paget Brewster, Janeane Garofalo, John Goodman, David Alan Grier, Don Novello, Jon Polito, Carl Reiner, Whoopi Goldberg, Max Grodenchik, Norman Lloyd, Jonathan Winters and Billy Crystal. The film follows a young rookie FBI agent named Karen Sympathy enlisting the help of Rocky and Bullwinkle to stop Boris, Natasha, and Fearless Leader from taking over the United States.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/78/Adventuresofrockyandbullwinklemovieposter.jpg",
    "thumbnail_width": 269,
    "thumbnail_height": 370
  },
  {
    "title": "All the Pretty Horses",
    "year": 2000,
    "cast": [
      "Matt Damon",
      "Penélope Cruz",
      "Henry Thomas",
      "Lucas Black",
      "Rubén Blades",
      "Míriam Colón",
      "Bruce Dern"
    ],
    "genres": [
      "Western"
    ],
    "href": "All_the_Pretty_Horses_(film)",
    "extract": "All the Pretty Horses is a 2000 American Western film produced and directed by Billy Bob Thornton, based on Cormac McCarthy's novel of the same name, and starring Matt Damon and Penélope Cruz. It premiered on December 25, 2000 to mostly negative reviews. It grossed $18 million worldwide on a $57 million budget.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b0/All_the_Pretty_Horses_Poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 385
  },
  {
    "title": "Almost Famous",
    "year": 2000,
    "cast": [
      "Billy Crudup",
      "Frances McDormand",
      "Kate Hudson",
      "Jason Lee",
      "Patrick Fugit",
      "Anna Paquin",
      "Fairuza Balk"
    ],
    "genres": [
      "Comedy",
      "Drama"
    ],
    "href": "Almost_Famous",
    "extract": "Almost Famous is a 2000 American comedy-drama film written and directed by Cameron Crowe, and starring Billy Crudup, Frances McDormand, Kate Hudson, and Patrick Fugit. It tells the story of a teenage journalist, played by Fugit, writing for Rolling Stone magazine in the early 1970s, touring with the fictitious rock band Stillwater, and writing his first cover story on the band. The film is semi-autobiographical, as Crowe himself was a teenage writer for Rolling Stone.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/dd/Almost_famous_poster1.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "Dolittle",
    "year": 2020,
    "cast": [
      "Robert Downey Jr.",
      "Antonio Banderas",
      "Michael Sheen",
      "Emma Thompson",
      "Rami Malek",
      "John Cena",
      "Kumail Nanjiani",
      "Octavia Spencer",
      "Tom Holland",
      "Craig Robinson",
      "Ralph Fiennes",
      "Selena Gomez",
      "Marion Cotillard"
    ],
    "genres": [
      "Adventure",
      "Fantasy"
    ],
    "href": "Dolittle_(film)",
    "extract": "Dolittle is a 2020 American fantasy adventure film directed by Stephen Gaghan from a screenplay by Gaghan, Dan Gregor, and Doug Mand, based on a story by Thomas Shepherd. Dolittle is based on the title character created by Hugh Lofting and is primarily inspired by the author's second Doctor Dolittle book, The Voyages of Doctor Dolittle (1922). Robert Downey Jr. stars as the title character, alongside Antonio Banderas and Michael Sheen in live-action roles, with Emma Thompson, Rami Malek, John Cena, Kumail Nanjiani, Octavia Spencer, Tom Holland, Craig Robinson, Ralph Fiennes, Selena Gomez, and Marion Cotillard voicing an array of creatures.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1f/Dolittle_%282020_film_poster%29.png",
    "thumbnail_width": 220,
    "thumbnail_height": 326
  },
  {
    "title": "A Fall from Grace",
    "year": 2020,
    "cast": [
      "Crystal R. Fox",
      "Phylicia Rashad",
      "Bresha Webb",
      "Mehcad Brooks",
      "Cicely Tyson",
      "Tyler Perry"
    ],
    "genres": [
      "Thriller"
    ],
    "href": "A_Fall_from_Grace",
    "extract": "A Fall from Grace is a 2020 American thriller film produced, written, and directed by Tyler Perry and his first to be released by Netflix. The film follows a woman who finds a dangerous new love and the novice attorney who defends her in a sensational court case. This was the final film of actor Cicely Tyson before her death in January 2021.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4e/AFallFromGrace.png",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "The Gentlemen",
    "year": 2020,
    "cast": [
      "Matthew McConaughey",
      "Charlie Hunnam",
      "Henry Golding",
      "Michelle Dockery",
      "Jeremy Strong",
      "Eddie Marsan",
      "Colin Farrell",
      "Hugh Grant"
    ],
    "genres": [
      "Action",
      "Comedy"
    ],
    "href": "The_Gentlemen_(2019_film)",
    "extract": "The Gentlemen is a 2019 action comedy film written, directed and produced by Guy Ritchie, who developed the story along with Ivan Atkinson and Marn Davies. The film stars Matthew McConaughey, Charlie Hunnam, Henry Golding, Michelle Dockery, Jeremy Strong, Eddie Marsan, Colin Farrell, and Hugh Grant. It follows an American cannabis wholesaler in England who is looking to sell his business, setting off a chain of blackmail and schemes to undermine him.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/06/The_Gentlemen_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "The Turning",
    "year": 2020,
    "cast": [
      "Mackenzie Davis",
      "Finn Wolfhard",
      "Brooklynn Prince",
      "Joely Richardson"
    ],
    "genres": [
      "Horror",
      "Supernatural"
    ],
    "href": "The_Turning_(2020_film)",
    "extract": "The Turning is a 2020 American gothic supernatural horror film directed by Floria Sigismondi and written by Carey W. Hayes and Chad Hayes. It is a modern adaptation of the 1898 ghost story The Turn of the Screw by Henry James. It stars Mackenzie Davis, Finn Wolfhard, Brooklynn Prince, and Joely Richardson, and follows a young governess in 1994 who is hired to watch over two children after their parents are killed.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a2/The_Turning_poster_2020.jpg",
    "thumbnail_width": 251,
    "thumbnail_height": 397
  },
  {
    "title": "The Last Full Measure",
    "year": 2020,
    "cast": [
      "Sebastian Stan",
      "Christopher Plummer",
      "William Hurt",
      "Ed Harris",
      "Samuel L. Jackson",
      "Peter Fonda",
      "LisaGay Hamilton",
      "Jeremy Irvine",
      "Diane Ladd",
      "Amy Madigan",
      "John Savage",
      "Bradley Whitford"
    ],
    "genres": [
      "Drama",
      "War"
    ],
    "href": "The_Last_Full_Measure_(2019_film)",
    "extract": "The Last Full Measure is a 2019 American war drama film written and directed by Todd Robinson. It follows the efforts of fictional Pentagon staffer Scott Huffman and many veterans to see the Medal of Honor awarded to William H. Pitsenbarger, a United States Air Force Pararescueman who flew in helicopter rescue missions during the Vietnam War to aid downed soldiers and pilots. Based on true events, the film stars Sebastian Stan, Christopher Plummer, William Hurt, Ed Harris, Samuel L. Jackson, Jeremy Irvine, and Peter Fonda. It was the final film appearance of Fonda, who died before the film’s release; and Plummer's final on screen appearance before his death in 2021, though it had filmed prior to Knives Out which was released before it.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9d/The_Last_Full_Measure_2019_poster.jpg",
    "thumbnail_width": 256,
    "thumbnail_height": 378
  },
  {
    "title": "John Henry",
    "year": 2020,
    "cast": [
      "Terry Crews",
      "Ludacris",
      "Jamila Velazquez",
      "Ken Foree",
      "Tyler Alvarez",
      "Joseph Julian Soria"
    ],
    "genres": [
      "Drama",
      "Thriller"
    ],
    "href": "John_Henry_(2020_film)",
    "extract": "John Henry is a 2020 American thriller drama film starring Terry Crews and Ludacris, and directed by Will Forbes. Inspired by the folk lore of John Henry, the plot follows an ex-gang member from Los Angeles who must help two immigrant children who are on the run from his former crime boss. The film had a limited release on January 24, 2020, and received negative reviews from critics.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b8/JohnHenryPoster.jpeg",
    "thumbnail_width": 220,
    "thumbnail_height": 316
  },
  {
    "title": "The Rhythm Section",
    "year": 2020,
    "cast": [
      "Blake Lively",
      "Jude Law",
      "Sterling K. Brown"
    ],
    "genres": [
      "Action",
      "Thriller"
    ],
    "href": "The_Rhythm_Section",
    "extract": "The Rhythm Section is a 2020 action thriller film directed by Reed Morano and with a screenplay by Mark Burnell based on his novel of the same name. Starring Blake Lively, Jude Law and Sterling K. Brown, and follows a grieving woman who seeks revenge after discovering that the plane crash that killed her family was a terrorist attack.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/98/The_Rhythm_Section_poster.jpg",
    "thumbnail_width": 260,
    "thumbnail_height": 382
  },
  {
    "title": "Gretel & Hansel",
    "year": 2020,
    "cast": [
      "Sophia Lillis",
      "Sammy Leakey",
      "Charles Babalola",
      "Jessica De Gouw",
      "Alice Krige"
    ],
    "genres": [
      "Fantasy",
      "Horror"
    ],
    "href": "Gretel_%26_Hansel",
    "extract": "Gretel & Hansel is a 2020 dark fantasy horror film based on the German folklore tale \"Hansel and Gretel\" by the Brothers Grimm. The film is directed by Oz Perkins, and produced by Fred Berger, Brian Kavanaugh-Jones, and Dan Kagan, with a screenplay by Rob Hayes. Sophia Lillis and Sam Leakey portray the titular characters, alongside Alice Krige and Jessica De Gouw. The story follows Gretel and Hansel as they enter the dark woods in order to find work and food, and then stumble upon the home of a witch.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/de/Gretel_%26_Hansel_-_A_Grim_Fairy_Tale_theatrical_poster.jpeg",
    "thumbnail_width": 220,
    "thumbnail_height": 326
  },
  {
    "title": "The Assistant",
    "year": 2020,
    "cast": [
      "Julia Garner",
      "Matthew Macfadyen"
    ],
    "genres": [
      "Drama"
    ],
    "href": "The_Assistant_(2019_film)",
    "extract": "The Assistant is a 2019 American drama film written, directed, produced, and edited by Kitty Green. The film stars Julia Garner as a junior assistant at a film production company. Matthew Macfadyen, Makenzie Leigh, Kristine Froseth, Jon Orsini, and Noah Robbins also star.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9b/The_Assistant_poster.jpeg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "Birds of Prey",
    "year": 2020,
    "cast": [
      "Margot Robbie",
      "Mary Elizabeth Winstead",
      "Jurnee Smollett-Bell",
      "Rosie Perez",
      "Chris Messina",
      "Ella Jay Basco",
      "Ali Wong",
      "Ewan McGregor"
    ],
    "genres": [
      "Superhero"
    ],
    "href": "Birds_of_Prey_(2020_film)",
    "extract": "Birds of Prey (and the Fantabulous Emancipation of One Harley Quinn), also known as Harley Quinn: Birds of Prey or simply Birds of Prey, is a 2020 American superhero film directed by Cathy Yan and written by Christina Hodson, based on the DC Comics team, the Birds of Prey. Produced by Warner Bros., DC Films, LuckyChap Entertainment, Clubhouse Pictures, and Kroll & Co. Entertainment, it is the eighth installment in the DC Extended Universe (DCEU), and serves as a spin-off and sequel to Suicide Squad (2016). It stars Margot Robbie as Harley Quinn alongside Mary Elizabeth Winstead, Jurnee Smollett-Bell, Rosie Perez, Chris Messina, Ella Jay Basco, Ali Wong, and Ewan McGregor. The film follows Harley Quinn, who, after breaking up with the Joker, is threatened by Gotham City crime lord Roman Sionis, and joins forces with Helena Bertinelli, Dinah Lance and Renee Montoya (who go on to form the Birds of Prey) to save Cassandra Cain.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1c/Birds_of_Prey_%282020_film%29_poster.jpg",
    "thumbnail_width": 220,
    "thumbnail_height": 326
  },
  {
    "title": "The Lodge",
    "year": 2020,
    "cast": [
      "Riley Keough",
      "Jaeden Martell",
      "Lia McHugh",
      "Richard Armitage",
      "Alicia Silverstone"
    ],
    "genres": [
      "Horror"
    ],
    "href": "The_Lodge_(film)",
    "extract": "The Lodge is a 2019 psychological horror film directed by Veronika Franz and Severin Fiala, written by Franz, Fiala, and Sergio Casci, and starring Riley Keough, Jaeden Martell, Lia McHugh, Alicia Silverstone, and Richard Armitage. Its plot follows a soon-to-be stepmother who, alone with her fiancé's two children, becomes stranded at their rural lodge during Christmas. There, she and the children experience a number of unexplained events that seem to be connected to her past.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/cf/The_Lodge_poster.jpg",
    "thumbnail_width": 220,
    "thumbnail_height": 326
  },
  {
    "title": "Timmy Failure: Mistakes Were Made",
    "year": 2020,
    "cast": [
      "Winslow Fegley",
      "Ophelia Lovibond",
      "Craig Robinson",
      "Wallace Shawn"
    ],
    "genres": [
      "Adventure",
      "Comedy",
      "Drama",
      "Family",
      "Fantasy"
    ],
    "href": "Timmy_Failure:_Mistakes_Were_Made",
    "extract": "Timmy Failure: Mistakes Were Made is a 2020 American adventure fantasy comedy-drama family film based on the book series of the same name by Stephan Pastis that debuted on Disney+ on February 7, 2020. The film is directed by Tom McCarthy, produced by Alexander Dostal, McCarthy and Jim Whitaker from a screenplay written by McCarthy and Pastis and stars Winslow Fegley, Ophelia Lovibond, Craig Robinson and Wallace Shawn.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/c8/Timmy_Failure_Mistakes_Were_Made_Poster.jpeg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "Horse Girl",
    "year": 2020,
    "cast": [
      "Alison Brie",
      "Debby Ryan",
      "John Paul Reynolds",
      "Molly Shannon",
      "John Ortiz",
      "Paul Reiser"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Horse_Girl",
    "extract": "Horse Girl is a 2020 American psychological drama film directed and produced by Jeff Baena, from a screenplay written by Baena and Alison Brie. It stars Brie, Debby Ryan, John Reynolds, Molly Shannon, John Ortiz, and Paul Reiser.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/37/Horse_Girl_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 383
  },
  {
    "title": "To All the Boys: P.S. I Still Love You",
    "year": 2020,
    "cast": [
      "Lana Condor",
      "Noah Centineo",
      "Jordan Fisher",
      "Anna Cathcart",
      "John Corbett"
    ],
    "genres": [
      "Comedy",
      "Teen",
      "Romance"
    ],
    "href": "To_All_the_Boys:_P.S._I_Still_Love_You",
    "extract": "To All the Boys: P.S. I Still Love You is a 2020 American teen romantic comedy film directed by Michael Fimognari and written by Sofia Alvarez and J. Mills Goodloe. The film stars Lana Condor, Noah Centineo, Janel Parrish, Anna Cathcart, Trezzo Mahoro, Madeleine Arthur, Emilija Baranac, Kelcey Mawema, Jordan Fisher, Ross Butler, Julie Tao, Sarayu Blue, John Corbett, and Holland Taylor. The film is based on Jenny Han's 2015 novel P.S. I Still Love You.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/bc/To_All_the_Boys_-_P.S._I_Still_Love_You_official_release_poster.jpg",
    "thumbnail_width": 220,
    "thumbnail_height": 326
  },
  {
    "title": "Sonic the Hedgehog",
    "year": 2020,
    "cast": [
      "James Marsden",
      "Ben Schwartz",
      "Tika Sumpter",
      "Natasha Rothwell",
      "Adam Pally",
      "Neal McDonough",
      "Jim Carrey"
    ],
    "genres": [
      "Action",
      "Adventure",
      "Comedy"
    ],
    "href": "Sonic_the_Hedgehog_(film)",
    "extract": "Sonic the Hedgehog is a 2020 action-adventure comedy film based on the video game series published by Sega. Directed by Jeff Fowler and written by Pat Casey and Josh Miller, it stars Ben Schwartz as the voice of Sonic the Hedgehog, alongside Jim Carrey and James Marsden, with supporting roles by Tika Sumpter, Natasha Rothwell, Adam Pally, Lee Majdoub and Neal McDonough. The film follows Sonic, a blue anthropomorphic hedgehog who can run at supersonic speeds. He teams up with a town sheriff, Tom Wachowski (Marsden), to stop the mad scientist Dr. Robotnik (Carrey).",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/45/Sonic_the_Hedgehog_film_poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "Fantasy Island",
    "year": 2020,
    "cast": [
      "Michael Peña",
      "Maggie Q",
      "Lucy Hale",
      "Austin Stowell",
      "Portia Doubleday",
      "Jimmy O. Yang",
      "Ryan Hansen",
      "Michael Rooker"
    ],
    "genres": [
      "Horror",
      "Supernatural"
    ],
    "href": "Fantasy_Island_(film)",
    "extract": "Fantasy Island, also known as Blumhouse's Fantasy Island, is a 2020 American supernatural horror film directed and co-written by Jeff Wadlow. Serving both as a horror reimagining and a prequel to ABC's 1977 television series of the same name, it stars Michael Peña, Maggie Q, Lucy Hale, Austin Stowell, Jimmy O. Yang, Ryan Hansen, Portia Doubleday, and Michael Rooker and follows a group of people who, while visiting the eponymous island, discover that their dream-like fantasies brought to life begin to turn into horrific living nightmares and they must try to survive.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/7e/Fantasy_Island_poster.jpg",
    "thumbnail_width": 220,
    "thumbnail_height": 326
  },
  {
    "title": "The Photograph",
    "year": 2020,
    "cast": [
      "Issa Rae",
      "Lakeith Stanfield",
      "Chelsea Peretti",
      "Lil Rel Howery",
      "Courtney B. Vance"
    ],
    "genres": [
      "Drama",
      "Romance"
    ],
    "href": "The_Photograph_(2020_film)",
    "extract": "The Photograph is a 2020 American romantic drama film written and directed by Stella Meghie. It follows the estranged daughter of a famous photographer who falls in love with the journalist who is investigating her late mother's life. Chelsea Peretti, Lil Rel Howery and Courtney B. Vance also star.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/c4/The_Photograph_poster.jpg",
    "thumbnail_width": 251,
    "thumbnail_height": 397
  },
  {
    "title": "Downhill",
    "year": 2020,
    "cast": [
      "Julia Louis-Dreyfus",
      "Will Ferrell",
      "Miranda Otto",
      "Zoë Chao",
      "Zach Woods"
    ],
    "genres": [
      "Comedy",
      "Drama"
    ],
    "href": "Downhill_(2020_film)",
    "extract": "Downhill is a 2020 American black comedy-drama film directed by Nat Faxon and Jim Rash, who also co-wrote the script with Jesse Armstrong. The film is a remake of Force Majeure (2014) by Swedish director Ruben Östlund. It stars Julia Louis-Dreyfus and Will Ferrell as a married couple going through a rough patch after a near-death encounter during a family ski outing.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/6a/Downhill_poster.jpeg",
    "thumbnail_width": 258,
    "thumbnail_height": 386
  },
  {
    "title": "Spy Intervention",
    "year": 2020,
    "cast": [
      "Drew Van Acker",
      "Poppy Delevingne",
      "Natasha Bassett",
      "Max Silvestri",
      "Brittany Furlan",
      "Blake Anderson"
    ],
    "genres": [
      "Action",
      "Comedy",
      "Spy"
    ],
    "href": "Spy_Intervention",
    "extract": "Spy Intervention is a 2020 American action comedy spy film directed by Drew Mylrea and written by Mark Famiglietti and Lane Garrison. The film stars Drew Van Acker, Poppy Delevingne and Blake Anderson.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/cf/Spy_Intervention_%282020%29_Film_Poster.jpg",
    "thumbnail_width": 236,
    "thumbnail_height": 350
  },
  {
    "title": "The Kindness of Strangers",
    "year": 2020,
    "cast": [
      "Andrea Riseborough",
      "Tahar Rahim",
      "Zoe Kazan",
      "Bill Nighy",
      "Caleb Landry Jones",
      "Jay Baruchel"
    ],
    "genres": [
      "Drama"
    ],
    "href": "The_Kindness_of_Strangers_(film)",
    "extract": "The Kindness of Strangers is a 2019 internationally co-produced drama film, written and directed by Lone Scherfig. It stars Zoe Kazan, Tahar Rahim, Esben Smed, Andrea Riseborough, and Caleb Landry Jones.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/8d/The_Kindness_of_Strangers_poster.jpg",
    "thumbnail_width": 263,
    "thumbnail_height": 379
  },
  {
    "title": "A.k.a. Cassius Clay",
    "year": 1970,
    "cast": [
      "Muhammad Ali"
    ],
    "genres": [
      "Documentary",
      "Sports"
    ],
    "href": "A.k.a._Cassius_Clay",
    "extract": "A.k.a. Cassius Clay is a 1970 boxing documentary film about the former heavyweight champion Muhammad Ali.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/17/Film_Poster_for_a.k.a._Cassius_Clay.jpg",
    "thumbnail_width": 264,
    "thumbnail_height": 376
  },
  {
    "title": "Adam at Six A.M.",
    "year": 1970,
    "cast": [
      "Michael Douglas",
      "Lee Purcell",
      "Joe Don Baker",
      "Louise Latham"
    ],
    "genres": [
      "Drama"
    ],
    "href": "Adam_at_Six_A.M.",
    "extract": "Adam at 6 A.M. is a 1970 American drama film directed by Robert Scheerer. It stars Michael Douglas, Lee Purcell, Joe Don Baker, Louise Latham, Charles Aidman, Grayson Hall, Marge Redmond, and Dana Elcar. The film did not receive much attention when it was released. The film was filmed almost entirely on location in the small Midwest town of Excelsior Springs, Missouri, as well as Cameron, Missouri and Orrick, Missouri.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/43/AdamAtSixAM1970Poster.jpg",
    "thumbnail_width": 256,
    "thumbnail_height": 389
  },
  {
    "title": "Adam's Woman",
    "year": 1970,
    "cast": [
      "Beau Bridges",
      "Jane Merrow",
      "John Mills",
      "James Booth"
    ],
    "genres": [
      "Historical",
      "Drama"
    ],
    "href": "Adam%27s_Woman",
    "extract": "Adam's Woman is a 1970 Australian-American historical drama film directed by Philip Leacock and starring Beau Bridges, Jane Merrow and John Mills. It has been called a \"convict Western\".",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/85/Adam%27s_Woman.jpg",
    "thumbnail_width": 264,
    "thumbnail_height": 376
  },
  {
    "title": "The Adventurers",
    "year": 1970,
    "cast": [
      "Bekim Fehmiu",
      "Candice Bergen",
      "Charles Aznavour",
      "Olivia de Havilland"
    ],
    "genres": [
      "Drama",
      "Adventure"
    ],
    "href": "The_Adventurers_(1970_film)",
    "extract": "The Adventurers is a 1970 American adventure drama film directed, produced, and co-written by Lewis Gilbert. It is based on the 1966 novel of the same name by Harold Robbins.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1c/The_Adventurers_-_1970_-_poster.png",
    "thumbnail_width": 256,
    "thumbnail_height": 390
  },
  {
    "title": "Airplane!",
    "year": 1980,
    "cast": [
      "Robert Hays",
      "Julie Hagerty",
      "Leslie Nielsen",
      "Peter Graves",
      "Robert Stack",
      "Lloyd Bridges",
      "Kareem Abdul-Jabbar"
    ],
    "genres": [
      "Comedy",
      "Satire"
    ],
    "href": "Airplane!",
    "extract": "Airplane! is a 1980 American parody film written and directed by the brothers David and Jerry Zucker, and Jim Abrahams in their directorial debuts, and produced by Jon Davison. It stars Robert Hays and Julie Hagerty and features Leslie Nielsen, Robert Stack, Lloyd Bridges, Peter Graves, Kareem Abdul-Jabbar, and Lorna Patterson. It is a parody of the disaster film genre, particularly the 1957 Paramount film Zero Hour!, from which it borrows its plot, central characters, and some dialogue. It also draws many elements from Airport 1975 and other films in the Airport series. It is known for its use of surreal humor and fast-paced slapstick comedy, including visual and verbal puns, gags, running jokes, and obscure humor.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/21/Airplane%21_%281980_film%29.jpg",
    "thumbnail_width": 258,
    "thumbnail_height": 386
  },
  {
    "title": "Alex and the Doberman Gang",
    "year": 1980,
    "cast": [
      "Jack Stauffer",
      "Taurean Blacque",
      "Cindy Acker"
    ],
    "genres": [
      "Action",
      "Comedy",
      "Family"
    ],
    "href": null
  },
  {
    "title": "Alien Dead",
    "year": 1980,
    "cast": [
      "Buster Crabbe"
    ],
    "genres": [
      "Science Fiction",
      "Horror"
    ],
    "href": "Alien_Dead",
    "extract": "Alien Dead is an American horror film directed by Fred Olen Ray. Ray co-wrote the script with Martin Nicholas. The film involves a meteor hitting a houseboat, which causes the people on board to become zombies who eat alligators and eventually people.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/8f/Aliendeaddvd.jpg",
    "thumbnail_width": 272,
    "thumbnail_height": 384
  },
  {
    "title": "Alligator",
    "year": 1980,
    "cast": [
      "Robert Forster",
      "Robin Riker",
      "Henry Silva",
      "Dean Jagger"
    ],
    "genres": [
      "Horror",
      "Independent"
    ],
    "href": "Alligator_(film)",
    "extract": "Alligator is a 1980 American independent horror film directed by Lewis Teague and written by John Sayles. It stars Robert Forster, Robin Riker and Michael V. Gazzo. It also includes an appearance by actress Sue Lyon in her last screen role. Set in Chicago, the film follows a police officer and a reptile expert who track an enormous, ravenous man-eating alligator flushed down the toilet years earlier, that is attacking residents after escaping from the city’s sewers.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/c9/Alligator_poster.jpg",
    "thumbnail_width": 241,
    "thumbnail_height": 366
  },
  {
    "title": "Altered States",
    "year": 1980,
    "cast": [
      "William Hurt",
      "Blair Brown"
    ],
    "genres": [
      "Science Fiction",
      "Horror"
    ],
    "href": "Altered_States",
    "extract": "Altered States is a 1980 American science fiction body horror film directed by Ken Russell, and based on the novel of the same name by playwright and screenwriter Paddy Chayefsky. The film was adapted from Chayefsky's 1978 novel and is his final screenplay. The novel and the film are based in part on John C. Lilly's sensory deprivation research conducted in isolation tanks, under the influence of psychoactive drugs like mescaline, ketamine and LSD.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fc/Altered_states.jpg",
    "thumbnail_width": 229,
    "thumbnail_height": 350
  },
  {
    "title": "Amber Waves",
    "year": 1980,
    "cast": [
      "Dennis Weaver",
      "Kurt Russell",
      "Fran Brill",
      "Wilford Brimley",
      "Mare Winningham"
    ],
    "genres": [
      "Drama"
    ],
    "href": null
  },
  {
    "title": "American Gigolo",
    "year": 1980,
    "cast": [
      "Richard Gere",
      "Lauren Hutton",
      "Héctor Elizondo"
    ],
    "genres": [
      "Drama",
      "Crime",
      "Noir"
    ],
    "href": "American_Gigolo",
    "extract": "American Gigolo is a 1980 American neo-noir crime drama film written and directed by Paul Schrader, and starring Richard Gere and Lauren Hutton. It tells the story of a high-priced escort in Los Angeles (Gere) who becomes romantically involved with a prominent politician's wife (Hutton), while simultaneously becoming the prime suspect in a murder case.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/43/American_gigolo_post.jpg",
    "thumbnail_width": 220,
    "thumbnail_height": 332
  }
]
